isRightHanded(OdGeSurface!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Determine is surface right-handed or left-handed.
The handedness of a surface describes the direction of the surface normals with respect to the  and  parameter directions.
If a surface is right-handed, then the surface normal is in the direction of the cross product of the partial derivatives with respect to and, in that order.
If a surface is left-handed, the surface direction would be in the opposite direction.
In other words, if a surface is right-handed, the direction of the surface normal at any given point on the surface follows the right-hand rule with respect
to the and parameter directions at that point. If a surface is left-handed, the direction of its normals follow the left-hand rule
\param surf    [in]  input surface.
Corresponding C++ library: TD_Ge